Autodesk.Revit.UI.ExternalDataManagerUtils.OnClose
TODO: Make this public_api_internal after remove public_api_extdata.
This is internal API, not intended for public use.
Handles manage links dialog close.
Used internally to clean up cached data in the built in servers.
External callers should not rely on this method as it may become
internal in a future release.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.RemoveHightlight(Autodesk.Revit.DB.Document)
Remove highlight and apply.
Clears any temporary selection/highlighting applied by
ExternalDataManagerTool.Show and forces the view to refresh.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.CompleteDocEditing(Autodesk.Revit.DB.Document)
abort current active editor.
Commits or rolls-back the active transaction/editor to ensure the model
is in a consistent state before executing Manage Links
operations that are not allowed inside an open transaction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.UpdateAllViews(Autodesk.Revit.DB.Document)
Update all views.
Triggers a background regeneration similar to Document.Regenerate but
limited to view-related data. Intended for scenarios where link changes
might affect visibility or positions of placed instances.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.IsLinkCommandDisabledInDocument(Autodesk.Revit.DB.Document)
Returns false if the linked files could be edited.
The function interrogates worksharing state, document permissions, and
other pre-conditions that could prohibit editing links.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.OnReferenceTypesChanged(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{System.Int64},System.String)
Handles the reference type change for multiple rows, from overlay to attachment or vice versa.
This helper updates the underlying data model and pushes the change down
to the corresponding server so that it can adjust internal state or
reload the reference if necessary.
aDoc:
Document whose data was modified.
rowIds:
Array of unique ids of the affected ExternalDataManagerDataItem rows.
newReferenceType:
Target reference type (typically "Overlay" or "Attachment").
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.OnReferenceTypeChanged(Autodesk.Revit.DB.Document,System.Int64,System.String)
Handles the reference type change, from overlay to attachment or vice versa.
This helper updates the underlying data model and pushes the change down
to the corresponding server so that it can adjust internal state or
reload the reference if necessary.
aDoc:
Document whose data was modified.
rowId:
Unique id of the affected ExternalDataManagerDataItem row.
newReferenceType:
Target reference type (typically "Overlay" or "Attachment").
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.GetAllCommands
Returns registered commands.
The result combines built-in entries from BuiltInExternalDataMgrCommand
with any custom commands registered by third-party servers through
ExternalDataManagerCommand::registerCommand().
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.GetNativeServers
Returns registered servers.
The list is obtained from ExternalDataMgrService and only include
Autodesk-supplied loaded from add-ins.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.GetServers
Returns registered servers.
The list is obtained from ExternalDataMgrService and may include
Autodesk-supplied as well as third-party servers loaded from add-ins.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExternalDataManagerUtils
Utilities for external data manager.
Remarks:
A small collection of helper functions that encapsulate common UI- or
document-centric tasks performed by the Manage Links dialog and
its backing commands. The helpers are intentionally kept independent of
any particular server implementation so that both Autodesk-supplied and
third-party servers can reuse them.
All functions are `static` because the utility class is stateless.
Callers should prefer these helpers over duplicating the same logic in
multiple places.
Since:
2027